Execution result of `run-all plan` in `infrastructure/cloud` :
```
time=2023-10-19T00:47:21Z level=info msg=The stack at /github/workspace/infrastructure/cloud will be processed in the following order for command plan:
Group 1
- Module /github/workspace/infrastructure/cloud/aws/global/health-check
- Module /github/workspace/infrastructure/cloud/b2/bucket
- Module /github/workspace/infrastructure/cloud/cloudflare/access
- Module /github/workspace/infrastructure/cloud/cloudflare/tunnel

Group 2
- Module /github/workspace/infrastructure/cloud/cloudflare/dns



Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Installing integrations/github v5.40.0...
- Installing hashicorp/aws v5.21.0...

Initializing provider plugins...
- Reusing previous version of integrations/github from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file- Reusing previous version of hashicorp/aws from the dependency lock file

- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Installing integrations/github v5.40.0...
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/aws v5.21.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/aws v5.21.0...
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installing backblaze/b2 v0.8.4...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.17.0...
- Installed cloudflare/cloudflare v4.17.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.16.0...
- Installing cloudflare/cloudflare v4.16.0...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

Terraform has been successfully initialized!
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
cloudflare_tunnel.this: Refreshing state... [id=de250703-6c08-400d-b568-bc0aa34cabaf]
b2_bucket.this: Refreshing state... [id=62c5440382b735a482bf081b]
data.github_ip_ranges.this: Reading...
data.github_ip_ranges.this: Read complete after 0s [id=github-ip-ranges]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
data.github_ip_ranges.this: Reading...
cloudflare_access_application.this: Refreshing state... [id=bcaa03ae-0a94-42ad-935c-487ca0a80723]
data.github_ip_ranges.this: Read complete after 1s [id=github-ip-ranges]
cloudflare_access_policy.this: Refreshing state... [id=1b62d9cb-f555-4d23-b815-dfe3f92bd2a1]
cloudflare_access_policy.github: Refreshing state... [id=2a1fc41f-8d41-4f1f-8e72-91b0970ab129]
aws_route53_health_check.this: Refreshing state... [id=8d5724bf-ffc1-4a4c-bd03-e966403d2e28]
aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-east-1:477397881710:github-otaru-health-check-alarm-topic]
aws_cloudwatch_metric_alarm.this: Refreshing state... [id=github-otaru-health-check-alarm]
data.aws_ip_ranges.this: Reading...
data.aws_ip_ranges.this: Read complete after 0s [id=1697668990]
cloudflare_access_policy.aws: Refreshing state... [id=3be53152-3953-42b9-9c3f-845755693a57]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.this will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ dimensions                = {
          - "HealthCheckId" = "8d5724bf-ffc1-4a4c-bd03-e966403d2e28"
        } -> (known after apply)
        id                        = "github-otaru-health-check-alarm"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_route53_health_check.this must be replaced
-/+ resource "aws_route53_health_check" "this" {
      ~ arn                    = "arn:aws:route53:::healthcheck/8d5724bf-ffc1-4a4c-bd03-e966403d2e28" -> (known after apply)
      - child_health_threshold = 0 -> null
      - child_healthchecks     = [] -> null
      ~ enable_sni             = true -> (known after apply)
      ~ failure_threshold      = 3 -> (known after apply)
      ~ id                     = "8d5724bf-ffc1-4a4c-bd03-e966403d2e28" -> (known after apply)
      - invert_healthcheck     = false -> null
      - port                   = 443 -> null
      - regions                = [] -> null
      - request_interval       = 30 -> null # forces replacement
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ resource_path          = (sensitive value)
        tags                   = {
            "Name" = "github-otaru"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
cloudflare_record.internal_record["longhorn_internal"]: Refreshing state... [id=9d9e7849509ddd1ca1420bfb93085ddb]
cloudflare_record.internal_record["kiali_internal"]: Refreshing state... [id=3e29d0bc6567b4c0fecd6db58e432160]
cloudflare_record.public_record: Refreshing state... [id=16e19a8901e14239e7345e3922f318f9]
cloudflare_record.internal_record["adguard_internal"]: Refreshing state... [id=5803590e9218027a34aae666383f8211]
cloudflare_record.internal_record["jellyfin_internal"]: Refreshing state... [id=62786f77078b02d784342427605ba9e9]
cloudflare_record.internal_record["sftpgo_internal"]: Refreshing state... [id=d53e66b848b3967bd5a9885eb2c8e08c]
cloudflare_record.internal_record["argocd_internal"]: Refreshing state... [id=ad2633b9ce86a1786416dd851cb5c4d3]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```
    